public class task2 {
    public static void main(String[] args) {
        int n = 456; // Задане тризначне число

        int max = 0; // Змінна для збереження максимальної цифри

        // Розділення числа на цифри та пошук максимальної цифри
        while (n > 0) {
            int d = n % 10; // Отримання останньої цифри
            if (d > max) {
                max = d; // Оновлення максимальної цифри
            }
            n /= 10; // Видалення останньої цифри
        }

        System.out.println("Найбільша цифра в заданому числі: " + max);
    }
}
